#Да се напише програма, която да създаде множество от множества, което да 
#съдържа: А - B, B, B-A, A-B + B-A, A & B, A | B, където A и B са два списъка, чиито 
#елементи се въвеждат от клавиатурата.

def main(): 
    # Въвеждане на елементите на списъците A и B от клавиатурата
    A = set(input('Въведете елемент на А, разделени със запетая:').split(','))
    B = set(input('Въведи елемент на B, разделен със запетая:').split(','))

## Създаване на множество от множества, като се използват операциите с множества
    result_set= {
        A-B, # Разлика A - B
        B,
        B-A, # Разлика B - A
        (A-B)|(B-A), # Обединение на разликите A - B и B - A
        A&B, # Сечение A & B
        A|B # Обединение A | B
    }
 # Извеждане на множеството от множества
    print('Множество от множества:')
    for subset in result_set:
        print(subset)

if __name__=='__main__':
    main()






