my_integer = 25
first_name = "Martina"
# String (низ от символи)
my_string = "Python 2024"
# Boolean (логическа стойност)
my_boolean = False
# Float (дробно число)
num1 = 0.5
num2 = 0.6
# Изчисление с дробни числа
result = num1 + num2

# Datetime (дата и час)
import datetime
my_datetime = datetime.datetime.now()

#Принтиране на стойностите
print("Age:", my_integer)
print("Name:", first_name)
print("Course:", my_string)
print("Is married:", my_boolean)
print("Date:", my_datetime)
print("Result of data from the course:", result)



# Присвояване на стойности на променливи
x = 3
y = 10

# Изчисляване на резултат
result = x + y

# Извеждане на резултата
print(f"{x} + {y} = {result}")


#Задача5
# Дефиниране на височина и база
height = 13.66  # височина в см
base = 245.54  # срещуположната страна в см

# Изчисляване на лицето на триъгълника
area = 0.5 * base * height

# Извеждане на резултата
print("Лицето на триъгълника е:", area, "кв. см")

#Задача6
# Деклариране на променливи за данните на служителя
first_name = "Dimitar"
last_name = "Georgiev" 
age = 20
gender = "male"
unique_id = 588

# Извеждане на информацията за служителя
print("Name:", first_name)
print("Last Name:", last_name)
print("Age:", age)
print("Employee Id:", unique_id)

#Задача 7
# Деклариране на променливи и задаване на стойности
num1 = 5
num2 = 10

# Извеждане на оригиналните стойности
print("Първо число (преди размяна):", num1)
print("Второ число (преди размяна):", num2)

# Размяна на стойностите
temp = num1
num1 = num2
num2 = temp

# Извеждане на новите стойности след размяната
print("Първо число (след размяна):", num1)
print("Второ число (след размяна):", num2)

#Задача 8 
# Въвеждане на дължина и височина на паралелограма
length = float(input("Въведете дължина на успоредника: "))
height = float (input("Въведете височина на успоредника: "))

# Изчисляване на периметъра и лицето 
perimeter = 2* (length + height)
area = length = height 

#Резултат 
print("Периметърът на успоредника е", perimeter)
print("Лицето на успоредника е", area)

#Задача 9 
# Въвеждане на стойности за страните на триъгълника
import math
a = float(input("Въведете дължината на страна a:"))
b = float(input("Въведете дължината на страна b: "))

# Пресмятане на хипотенузата (c) с помощта на Питагоровата теорема
c = math.sqrt(a**2 + b**2)

# Отпечатване на резултата
print("Хипотенузата (c) е:", c)

#Задача 10 
import math
# Въвеждане на радиуса на кръга
radius = float(input("Въведете радиуса на кръга: "))

# Пресмятане на лицето на кръга
area = math.pi * radius**2

# Отпечатване на резултата
print("Лицето на кръга е:", area)

#Задача 11
# Въвеждане на дължина в инчове








