#Да се напише програма, която да намира броят на четните и нечетните числа
#от списък от цели числа.
#Вход:
#numbers = [1,2,3,4,5,6,7,8,9]
#Изход:
#Number of even numbers: 4
#Number of odd numbers: 5



def count_even_odd(numbers):
    even_count = 0  # Променлива, която съхранява броя на четните числа
    odd_count = 0   # Променлива, която съхранява броя на нечетните числа
    for number in numbers: # Обхождаме всички числа от подадения списък
        if number %2 == 0:  # Проверка дали числото е четно
            even_count +=1 # Увеличаваме броя на четните числа
        else:
            odd_count +=1  # Увеличаваме броя на нечетните числа
    return even_count, odd_count # Връщаме две стойности - броя на четните и броя на нечетните числа

def main():
    numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]  # Даден списък от цели числа
    even_count, odd_count = count_even_odd(numbers)  # Извикване на функцията count_even_odd със списъка
    print('Брой на четните числа:', even_count)  # Извеждане на броя на четните числа
    print('Броя на нечетните числа:', odd_count) # Извеждане на броя на нечетните числа

if __name__=='__main__':
    main()



