#Да се напише програма, която принтира редицата на Фибоначи между 0 и 50.
#Редицата на Фибоначи е: 0, 1, 1, 2, 3, 5, 8, 13, 21, … Всяко следващо число е сумата от
#предходните две.
#Изход: 1 1 2 3 5 8 13 21 34


def fibonachi_sequence(n):
    fibonachi = [0,1] # Започваме с първите две числа от редицата 
    while fibonachi[-1] + fibonachi[-2] <=n:  # Докато следващото число не надвиши n
       fibonachi.append(fibonachi[-1]+fibonachi[-2])  # Добавяме новото число в редицата
    return fibonachi[1:] # Връщаме редицата, без първото число (0)

def main():
    n = 50 # Горна граница за редицата на Фибоначи
    fibonachi = fibonachi_sequence(n)  # Генерираме редицата на Фибуначи до n
    print('Редицата на Фибоначи до', n, 'е:', ' '. join(map(str, fibonachi)))
          
if __name__=='__main__':
    main()

