#Да се състави програма, която изчислява сумата на произведенията от 1 до
#въведено едноцифрено число.
#Сумата се формира така:
#1*2 + 2*3*4 +..+n*(n+1)*(n+2)*..*2*n
#Вход: 4
#Изход: 7106

def calculate_sum(n):
    result = 0 #Променлива, в която ще се натрупва сумата на произведенията

    for i in range (1, n+1): # Обхождане на числата от 1 до въведеното едноцифрено число
        product = 1
        for j in range(i, 2 * i + 1): ## Пресмятане на произведението на числата от i до 2 * i, включително
            product *=j
           # Добавяне на текущото произведение към сумата
        result += product

      # Връщане на крайния резултат
    return result

     # Входните данни
number = int(input('Въведете едноцифрено число: '))

      # Изчисляване и извеждане на резултата
print('Сумата на произведението е: ', calculate_sum(number))



