#Да се напише програма, която да създаде следният шаблон:
#*
#* *
#* * *
#* * * *
#* * * * *
#* * * *
#* * *
#* *
#*
    
#Извикваме осовния метод 
def main():
    # Брой редове до средата
    n=5 
    # Печат на първата половина на шаблона (растящ брой на звездичките)
    for i in range(1,n+1):
         # От 1 до n (включително)
        print('*'*i)  # Печат на i звездички на всеки ред
         # Печат на втората половина на шаблона (намаляващ брой на звездичките)
    for i in range(n-1,0,-1):  # От n - 1 до 1 (включително), със стъпка -1
        print('*'*i) # Печат на i звездички на всеки ред


#извикване основния метод 
if __name__ == '__main__':
    main()