# Входни данни - две целочислени променливи
#Да се напише if-конструкция, която проверява стойността на две целочислени
#променливи и разменя техните стойности, ако стойността на първата променлива е по-голяма
#от втората. 

#a  = int(input('5'))
#b = int(input('3'))

# Проверка и размяна на стойностите, ако е необходимо
#if a>b:
 #   a,b = b,a

# Изходни данни

#print('Стойността на променливата:', a)
#print('Стойността на променливата:', b)


#Вариант 2
x = 5 
y = 3

# Проверка и размяна на стойностите, ако е необходимо
if x > y:
    temp = x
    x = y 
    y = temp

# Изходни данни
print('Стойност на x:', x)
print('Стойност на y:', y)

