#Напишете програма, която при въвеждане на коефициентите (a, b и c) на квадратно
# уравнение ax^2+bx+c изчислява и извежда неговите реални корени. 

import math

# Въвеждане на коефициентите на квадратното уравнение
a = float(input('Въведете коефициент a: '))
b = float(input('Въведете коефициент b: '))
c = float(input('Въведете коефициент c: '))

# Изчисляване на дискриминантата
discriminant = b**2 - 4*a*c

# Проверка за реални корени

if discriminant > 0: 
        # Изчисляване на двата реални корена
    root1 = (-b + math.sqrt(discriminant)) /(2*a)
    root2 = (-b - math.sqrt(discriminant)) /(2*a)

        # Извеждане на корените
    print("Корените на уравнението са:", root1, 'и', root2)

elif discriminant == 0:
    # Изчисляване на единствения реален корен (корен с кратност 2)
    root = -b / (2*a)

 # Извеждане на корените
    print("Уравнението има само един реален корен:", root)

else:
    # Извеждане на съобщение, че няма реални корени
    print("Уравнението няма реални корени")

