import math

#Да се състави програма, чрез която се въвежда 4-цифренo естествено число от интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа. Първото число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира от 2-рa - 3-та цифра на въведеното число. На екрана да се изведе дали 1-то ново число e по-малко <, равно = или по-голямо от 2-то число.
#Използвайте проверка на логическо условие - оператор if.
#Пример: 3332 Изход: по-малко (32<33)
#Пример: 1144 Изход: равни (14=14)
#Пример: 9875 Изход: по-голямо (95>87)


# Въвеждане на 4-цифрено число от потребителя
number=int(input('Въведете 4-цифрено естествено число(от 1000 до 9999):'))

# Извличане на цифрите на числото

first_digit = number //1000 
second_digit = (number//100) %10
third_digit = (number//10)%10
fourth_digit = number % 10

# Формиране на първото ново число
first_number = int(str(first_digit)+str(fourth_digit))

# Формиране на второто ново число
second_number = int(str(second_digit)+str(third_digit))

# Сравнение на новите числа и извеждане на резултата
if first_number <second_number:
    print('{}<{}'.format(first_number, second_number))
elif first_number == second_number:
    print('{} = {}'.format(first_number, second_number))

else:
    print("{}>{}".format(first_number, second_number))

