# Преди доста години имаше услуга - изпращане на луксозна телеграма.
#Поводи най-различни: рожден, имен ден, сватба и т.н. Цената се формираше по следния начин:
#цена за бланка (А) + цена за текст до 20 думи (B) + цена за всяка дума, след първите 20 думи (C)
#Стойностите на A, B, C са реални числа от интервала [0.02..0.89]. 
#Да се състави програма, чрез която по въведени брой думи, стойности за A, B и C се изчислява крайна цена на луксозна телеграма.
#Пример: A=0.2, B=0.5, 45 думи, C=0.05 Изход: 1.95

# Въвеждане на стойности за A, B и C
price_A = float(input('Въведете цена за бланка А(от 0.02 до 0.89):'))
price_B = float(input('Въведете цена за бланка B(от 0 до 0.89):'))
price_C = float(input('Въведете цена за бланка C(от 0 до 0.89):'))

# Проверка за валидност на въведените цени
if not (0.02<=price_A <=0.89) or not (0.02<=price_B <=0.89) or not (0.02<=price_C <=0.89):
    print("Невалидно въведени цени. Моля, въведете стойностите в интервала [0.02, 0.89].")
    exit()

# Въвеждане на броя думи в текста 
word_count = int(input('Въведете броя думи в текста:'))

# Изчисляване на цената на телеграмата
if word_count <=20:
    total_price = price_A + price_B
else:
    extra_words = word_count -20
    total_price = price_A + price_B + extra_words * price_C

# Извеждане на цената на телеграмата   
print('Цената на телеграмата:', total_price)