#Да се състави програма, която да изчислява периметър и площ на
#правоъгълник по въведени дължини на прилежащи страни - естествени числа от интервала [5 ..100]. Изведете съобщение, ако страните формират квадрат. Използвайте проверка на логическо условие - оператор if.
#Пример: 4,4 Изход: квадрат лице 16, периметър 16



# Въвеждане на дължините на страните на правоъгълника
side_a = int(input("Въведете дължината на страна а (от 5 до 100):"))
side_b = int(input('Въведете дължината на страната b (ot 5 do 100):'))

# Проверка дали страните формират квадрат
if side_a== side_b:
    print("Страните формират квадрат")

# Изчисляване на периметъра и лицето на правоъгълника    

perimeter = 2*(side_a + side_b)
area = side_a * side_b

# Извеждане на резултатите

print('Лице', area)
print('Периметър', perimeter)
