#Да се състави програма, чрез която се въвеждат 2 естествени двуцифрени числа a,b. Програмата да изведе съобщение дали последната цифра от произведението на двете числа е четна, както и самата цифра. 
#Входни данни: a,b - естествени числа от интервала [10..99].
#Използвайте проверка на логическо условие - оператор if.
#Пример: 15, 25 Изход: 375, 5 нечетна



# Въвеждане на двуцифрени числа от потребителя
a = int(input("Въведете първото двуцифрено число (от 10 до 99): "))
b = int(input("Въведете второто двуцифрено число (от 10 до 99): "))

# Произведението на двете числа
product = a * b

# Разделяме произведението на числата на 10
quotient = product // 10

# Извличаме последната цифра от произведението
last_digit = product % 10

# Проверяваме дали последната цифра е четна
if last_digit % 2 == 0:
    print("{} {} - четно число".format(quotient, last_digit))
else:
    print("{} {} - нечетно число".format(quotient, last_digit))
